### Join And Merge Pandas Dataframe

##### https://chrisalbon.com/python/data_wrangling/pandas_join_merge_dataframe/

In [46]:
import pandas as pd
from IPython import display as dp

In [132]:
raw_data1={'CignaId':[10001,10002,10003,10004],
           'FirstName':['Mallikarjun','Sheela','Ishaan','Iccha'],
           'LastName':['Bendigeri','Bendigeri','Bendigeri','Bendigeri'],
           'Age':[43,38,4,9]
           }

In [133]:
raw_data1

{'Age': [43, 38, 4, 9],
 'CignaId': [10001, 10002, 10003, 10004],
 'FirstName': ['Mallikarjun', 'Sheela', 'Ishaan', 'Iccha'],
 'LastName': ['Bendigeri', 'Bendigeri', 'Bendigeri', 'Bendigeri']}

In [142]:
df_family1=pd.DataFrame(raw_data1,columns=['CignaId','FirstName','LastName','Age'])

In [143]:
df_family1

   CignaId    FirstName   LastName  Age
0    10001  Mallikarjun  Bendigeri   43
1    10002       Sheela  Bendigeri   38
2    10003       Ishaan  Bendigeri    4
3    10004        Iccha  Bendigeri    9

In [136]:
raw_data2={'CignaId':[10001,10002,10003,10004],
            'Height':[5.6,5.5,4.0,3.6]
           }

In [148]:
dt_hieghts=pd.DataFrame(raw_data2,columns=['CignaId','Height'])

In [149]:
dt_hieghts

   CignaId  Height
0    10001     5.6
1    10002     5.5
2    10003     4.0
3    10004     3.6

In [140]:
raw_data3={'CignaId':[10005,10006,10007,10008],
           'FirstName':['Basavaraj','Shradha','Soham','Siddhant'],
           'LastName':['Bendigeri','Bendigeri','Bendigeri','Bendigeri'],
           'Age':[47,40,5,14]}

In [145]:
df_family2=pd.DataFrame(raw_data3)

In [146]:
#concatentate
df_new=pd.concat([df_family1,df_family2])

In [147]:
df_new

   Age  CignaId    FirstName   LastName
0   43    10001  Mallikarjun  Bendigeri
1   38    10002       Sheela  Bendigeri
2    4    10003       Ishaan  Bendigeri
3    9    10004        Iccha  Bendigeri
0   47    10005    Basavaraj  Bendigeri
1   40    10006      Shradha  Bendigeri
2    5    10007        Soham  Bendigeri
3   14    10008     Siddhant  Bendigeri

In [153]:
pd.merge(df_family1,dt_hieghts,on='CignaId')

   CignaId    FirstName   LastName  Age  Height
0    10001  Mallikarjun  Bendigeri   43     5.6
1    10002       Sheela  Bendigeri   38     5.5
2    10003       Ishaan  Bendigeri    4     4.0
3    10004        Iccha  Bendigeri    9     3.6

#### Merge two dataframes with both the left and right dataframes using the CignaId key
#### In case the columns on which the join happens is diffferent in both dataframes, this is hepful

In [168]:
pd.merge(df_family1,dt_hieghts,left_on='CignaId',right_on='CignaId')

   CignaId    FirstName   LastName  Age  Height
0    10001  Mallikarjun  Bendigeri   43     5.6
1    10002       Sheela  Bendigeri   38     5.5
2    10003       Ishaan  Bendigeri    4     4.0
3    10004        Iccha  Bendigeri    9     3.6

In [169]:
df_family1

   CignaId    FirstName   LastName  Age
0    10001  Mallikarjun  Bendigeri   43
1    10002       Sheela  Bendigeri   38
2    10003       Ishaan  Bendigeri    4
3    10004        Iccha  Bendigeri    9

In [180]:
raw_data4={'CId':[10001,10002,10003,10004,10005,10006,10007,10008],
            'Height':[5.6,5.5,4.0,3.6,6.0,5.3,11,5.0]
           }

In [181]:
dt_new_hieghts=pd.DataFrame(raw_data4)

In [182]:
dt_new_hieghts

     CId  Height
0  10001     5.6
1  10002     5.5
2  10003     4.0
3  10004     3.6
4  10005     6.0
5  10006     5.3
6  10007    11.0
7  10008     5.0

In [183]:
df_family1

   CignaId    FirstName   LastName  Age
0    10001  Mallikarjun  Bendigeri   43
1    10002       Sheela  Bendigeri   38
2    10003       Ishaan  Bendigeri    4
3    10004        Iccha  Bendigeri    9

In [184]:
pd.merge(df_family1,dt_new_hieghts,left_on='CignaId',right_on='CId')

   CignaId    FirstName   LastName  Age    CId  Height
0    10001  Mallikarjun  Bendigeri   43  10001     5.6
1    10002       Sheela  Bendigeri   38  10002     5.5
2    10003       Ishaan  Bendigeri    4  10003     4.0
3    10004        Iccha  Bendigeri    9  10004     3.6

In [186]:
pd.merge(df_family1,dt_new_hieghts,how='outer',left_on='CignaId',right_on='CId')

   CignaId    FirstName   LastName   Age    CId  Height
0  10001.0  Mallikarjun  Bendigeri  43.0  10001     5.6
1  10002.0       Sheela  Bendigeri  38.0  10002     5.5
2  10003.0       Ishaan  Bendigeri   4.0  10003     4.0
3  10004.0        Iccha  Bendigeri   9.0  10004     3.6
4      NaN          NaN        NaN   NaN  10005     6.0
5      NaN          NaN        NaN   NaN  10006     5.3
6      NaN          NaN        NaN   NaN  10007    11.0
7      NaN          NaN        NaN   NaN  10008     5.0

In [187]:
pd.merge(df_family1,dt_new_hieghts,how='inner',left_on='CignaId',right_on='CId')

   CignaId    FirstName   LastName  Age    CId  Height
0    10001  Mallikarjun  Bendigeri   43  10001     5.6
1    10002       Sheela  Bendigeri   38  10002     5.5
2    10003       Ishaan  Bendigeri    4  10003     4.0
3    10004        Iccha  Bendigeri    9  10004     3.6

In [189]:
pd.merge(df_family1,dt_new_hieghts,how='left',left_on='CignaId',right_on='CId')

   CignaId    FirstName   LastName  Age    CId  Height
0    10001  Mallikarjun  Bendigeri   43  10001     5.6
1    10002       Sheela  Bendigeri   38  10002     5.5
2    10003       Ishaan  Bendigeri    4  10003     4.0
3    10004        Iccha  Bendigeri    9  10004     3.6

In [190]:
pd.merge(df_family1,dt_new_hieghts,how='right',left_on='CignaId',right_on='CId')

   CignaId    FirstName   LastName   Age    CId  Height
0  10001.0  Mallikarjun  Bendigeri  43.0  10001     5.6
1  10002.0       Sheela  Bendigeri  38.0  10002     5.5
2  10003.0       Ishaan  Bendigeri   4.0  10003     4.0
3  10004.0        Iccha  Bendigeri   9.0  10004     3.6
4      NaN          NaN        NaN   NaN  10005     6.0
5      NaN          NaN        NaN   NaN  10006     5.3
6      NaN          NaN        NaN   NaN  10007    11.0
7      NaN          NaN        NaN   NaN  10008     5.0